HTML_and_CSS_Design_and_Build_Websites/008.Extra_Markup/008.000.Notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-08-20 Tue 15:24 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Ch.8 Extra Markup</title>
<meta name="author" content="Alfredo Mejia" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../../scratch/bulma/bulma.css" /></head>
<body>
<div id="content" class="content">
<h1 class="title">Ch.8 Extra Markup</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org6d567ff">Navigation</a></li>
<li><a href="#orgd83fdff">Notes</a>
<ul>
<li><a href="#org64a4378">Section 8.1: The Evolution of HTML</a></li>
<li><a href="#org98f42be">Section 8.2: DOCTYPES &amp; Comments in HTML</a></li>
<li><a href="#orgdefa36e">Section 8.3: ID and Class Attribute (Global Attributes)</a></li>
<li><a href="#org8283704">Section 8.4: Block Elements and Inline Elements</a></li>
<li><a href="#org40a290e">Section 8.5: Grouping Text &amp; Elements in a Block</a></li>
<li><a href="#orgbe2b07b">Section 8.6: IFrames</a></li>
<li><a href="#org4ecd1db">Section 8.7: Metadata Info About Web Pages</a></li>
<li><a href="#org0e17c10">Section 8.8: Escape Characters</a></li>
<li><a href="#org09b5328">Section 8.9: Simple Web Page with Extra Markup</a></li>
</ul>
</li>
<li><a href="#org276b519">Keywords</a></li>
<li><a href="#org339ed35">Questions</a></li>
<li><a href="#orgbecab15">Summary</a></li>
</ul>
</div>
</div>

<div id="outline-container-org6d567ff" class="outline-2">
<h2 id="org6d567ff">Navigation</h2>
<div class="outline-text-2" id="text-org6d567ff">
<p>
<b>Home</b>: HTML &amp; CSS - Design and Build Websites [<a href="../000.Home.html">html</a>] [<a href="../000.Home.html">org</a>] [<a href="https://github.com/alfredo-mejia/notes/tree/main/HTML%20%26%20CSS%20-%20Design%20and%20Build%20Websites">github</a>]
</p>

<p>
<b>Prev</b>: Ch.7 Forms [<a href="../007.Forms/007.000.Notes.html">html</a>] [<a href="../007.Forms/007.000.Notes.html">org</a>] [<a href="https://github.com/alfredo-mejia/notes/tree/main/HTML%20%26%20CSS%20-%20Design%20and%20Build%20Websites/007.Forms">github</a>]
</p>

<p>
<b>Next</b>: Ch.9 Flash, Video &amp; Audio [<a href="../009.Flash, Video &amp; Audio/009.000.Notes.html">html</a>] [<a href="../009.Flash, Video &amp; Audio/009.000.Notes.html">org</a>] [<a href="https://github.com/alfredo-mejia/notes/tree/main/HTML%20%26%20CSS%20-%20Design%20and%20Build%20Websites/009.Flash%2C%20Video%20%26%20Audio">github</a>]
</p>
</div>
</div>

<div id="outline-container-orgd83fdff" class="outline-2">
<h2 id="orgd83fdff">Notes</h2>
<div class="outline-text-2" id="text-orgd83fdff">
</div>
<div id="outline-container-org64a4378" class="outline-3">
<h3 id="org64a4378">Section 8.1: The Evolution of HTML</h3>
<div class="outline-text-3" id="text-org64a4378">
<ul class="org-ul">
<li>HTML4 was released in 1997 and although new elements were added in HTML5 many of them have been available since HTML4</li>
<li>Some presentational elements from HTML4 have been deprecated because almost all presentational elements can be replicated using CSS</li>
<li>In 1998 XML was introduced allowing people to write their own markup languages which had stricter rules than HTML</li>
<li>Thus it decided that HTML4 should be reformulated to follow the rules of XML and it was renamed to XHTML and thus XHTML 1.0 was released in 2000</li>
<li>Since XHTML was conforming to XML rules it worked seamlessly with programs that create and process XML documents and it worked well with other data formats such as SVG which was written in XML</li>
<li>There are other formats such as MathML and CML that also use XML</li>
<li>To help the transition there were 3 flavors of XHTML
<ol class="org-ol">
<li>Strict XHTML 1.0: Authors had to follow the rules to the letter</li>
<li>Transitional XHTML 1.0: Authors could still follow older practices, elements, and attributes that may be removed in the future</li>
<li>XHTML 1.0 Frameset: Authors could partition a browser window into several "frames" and each frame would hold a different HTML page</li>
</ol></li>
<li>XHTML 1.0 is based off HTML4</li>
<li>HTML5 was first published in 2008</li>
<li>In 2014 the W3C (World Wide Wide Consortium - an international standards organization for the World Wide Web) finally issued HTML5 as a W3C recommendation</li>
<li>HTML5 has since replaced both HTML4 and XHTML 1.0 with new elements, new attributes, and a new way to web develop</li>
</ul>
</div>
</div>

<div id="outline-container-org98f42be" class="outline-3">
<h3 id="org98f42be">Section 8.2: DOCTYPES &amp; Comments in HTML</h3>
<div class="outline-text-3" id="text-org98f42be">
<ul class="org-ul">
<li>There are several verisons of HTML so each web page should begin with a <code>DOCTYPE</code> declaration to tell a browser which version of HTML the page is using</li>
<li>Although browsers usually still render the web page without it, it is generally a good idea to state the <code>DOCTYPE</code></li>
<li>How do you specify HTML5? You simply state <code>&lt;!DOCTYPE html&gt;</code></li>
<li>If you want to add a comment to your code that will <b>not</b> be visilbe in the user's browser, you can add text in-between the characters <code>&lt;!-- comment --&gt;</code></li>
<li>The comments are only for the developer in HTML files and usually a good idea to add comments to make your code understandable for those reading your code (including yourself)</li>
<li>Although comments cannot be seen, if a user inspects the source code then the comments will appear</li>
<li>Comments can be used to indicate where sections of a page start and end, contain notes, or prevent elements from displaying</li>
</ul>
</div>
</div>

<div id="outline-container-orgdefa36e" class="outline-3">
<h3 id="orgdefa36e">Section 8.3: ID and Class Attribute (Global Attributes)</h3>
<div class="outline-text-3" id="text-orgdefa36e">
<ul class="org-ul">
<li>Every HTML element have global attributes including the <code>id</code> attribute and the <code>class</code> attribute</li>
<li>The id attribute is used to uniquely identify the element from other elements on the page</li>
<li>The id can only start with a letter or an underscore</li>
<li>No other id can be shared, all ids must be unique for that page</li>
<li>Using an id and CSS can help you style the element differently from other instances of the same HTML element (since you can identify that particular instance by using the id)</li>
<li>Not just CSS but also JS can be used with ids to allow a script to work with that particular element</li>
<li>What if you want to identify several elements as being different from other elements on the page? You do this by using the class attribute</li>
<li>The class attribute's value should describe the class it belongs to which can include zero, one, or many HTML elements</li>
<li>The class attribute is similar to id except it can distinguish a whole group of HTML elements (not just a single HTML element)</li>
<li>Thus the class attribute on any element can share the same name; it does not need to be the same one HTML element to have the same class</li>
<li>A HTML element can also have both an id and class attribute</li>
<li>Adding these attributes will not affect the presentation of an element (it actually does not do anything presentational just by adding them)</li>
<li>It is when you use CSS rules targeting the specified id or the specified class that HTML elements change in the way it is presented (styled)</li>
<li>Finally, a HTML element may have multiple classes and this is specified by simply separating the class names with a space (e.g. <code>class="class1 class2 class3"</code>)</li>
</ul>
</div>
</div>

<div id="outline-container-org8283704" class="outline-3">
<h3 id="org8283704">Section 8.4: Block Elements and Inline Elements</h3>
<div class="outline-text-3" id="text-org8283704">
<ul class="org-ul">
<li>Some elements will always apear to start on a new line in the browser window; these are known as block level elements (e.g. <code>&lt;h1&gt;</code>, <code>&lt;p&gt;</code>, <code>&lt;ul&gt;</code>, etc.)</li>
<li>Thus if you declare a block level element it will start on a new line</li>
<li>Some elements will always appear to continue on the same line as their neighboring elements; these are known as inline elements (e.g. <code>&lt;a&gt;</code>, <code>&lt;b&gt;</code>, <code>&lt;em&gt;</code>, etc.)</li>
<li>Thus if you declare an inline level element it will continue right next to the previous element declared</li>
</ul>
</div>
</div>
