Web/HTML_and_CSS_Design_and_Build_Websites/008.Extra_Markup/008.000.Notes.org
** Section 8.5: Grouping Text & Elements in a Block
   - The ~<div>~ element allows you to group a set of elements together in one block-level box
   - For example, you might create a ~<div>~ element to contain all of the elements for the header of your site (like I said this book is outdated, HTML5 introduced new semantic elements that are similar to ~<div>~ such as ~<header>~ and ~<nav>~ that would be better suited for the header of your site)
   - The ~<div>~ element is simply a generic container which allows you to group a set of elements togehter in a one block-level but it has no effect on the content or layout until it is styled in some way using CSS
   - The ~<div>~ element can also use the id attribute and class attribute to be styled later with CSS
   - This includes how much space the div block takes and changing the appearance of all the elements contained with it since CSS has inheritance properties when applying styling to a parent element
   - Div elements can be nested each other if needed to break down further groups of HTML elements
   - Div elements can make it easier to understand and follow your code since you are grouping together elements and thus breaking down your web page into small sections
   - Comments would be also useful to describe what is the purpose for the div element
   - *Note* that with HTML5 a lot of semantic elements were introduced that behave as ~<div>~ but semantically it means differently, it represents a specific type of group such as a header, footer, navigation, etc. basically it is like a div with a meaning
   - Another container element that is similar ~<div>~ is the ~<span>~ element
   - So what's the difference? The ~<span>~ element acts like an inline equivalent of the ~<div>~ element (div element is a block-level container while span is a inline-level container)
   - The ~<span>~ element is used to either contain a section of text where there is no other suitable element to differentiate it from its surrounding text or inside the span element there are a number of inline elements that will be grouped using ~<span>~
   - The most common reason people use ~<span>~ is so that they can control the appearance of the content or inline elements inside the ~<span>~ element
   - To further have control of styling the ~<span>~ element, developers often use the ~<span>~ element with the id or class attribute
   - Finally, *note* that in HTML5 semantics elements were also introduced to behave similar to ~<span>~ (inline container elements) just like there are semantic elements for ~<div>~ there are semantics elements for ~<span>~ such as the ~<time>~ element
   - These semantic elements are encourgaed when applicable than just a regular ~<div>~ or ~<span>~ because it is possible to just use div or span but semantic elements had meaning to your code and to assisitive technology which makes development and accessibility great in turn making a good website

** Section 8.6: IFrames
   - An iFrame is like a little window that has been cut into your page and inside the window that was cut you will be able to see another page
   - iFrame comes from the abbreviation of inline frame
   - Common uses of iFrames including embedding content from 3rd party websites such as YouTube videos, Google Maps, Tweets, Vimeo, secure payment flows, etc
   - An iframe is created using the ~<iframe>~ element but there are a few attributes that will be needed to use iframe correctly
   - One attribute is ~src~ which specifies the URL of the page to show in the frame
   - The ~height~ and ~width~ specify the height and width of the frame in pixels 
   - ~scrolling~ attribute will not be supported in HTML5 but in HTML4 and XHTML it is supported and indicates whether the iframe should have scrollbars or not
   - The ~scrolling~ attribute can be one of the three values: yes (show scrollbar), no (hide scrollbar), and auto (show only if needed)
   - ~frameborder~ will not be supported in HTML5 but in HTML4 and XHTML it indicates whether the frame should have a border or not (value of 0 indicates no border and value of 1 indicates a border)
   - ~seamless~ is an attribute introduced in HTML5 and removes the scrollbars but since then the ~seamless~ attribute has been removed and no longer exists ([[https://stackoverflow.com/questions/4804604/html5-iframe-seamless-attribute][more information in a Stackoverflow post]])

** Section 8.7: Metadata Info About Web Pages
   - The ~<meta>~ elements lives inside the ~<head>~ element and contains information about that specific web page
   - It is not visible to users but fulfills a number of purposes such as telling search engines about your page, who created it, whether or not it is time sensitive, and more
   - The ~<meta>~ element is a self-closing element so it does not have a closing tag and it uses the attributes to carry the information
   - The most common attributes are the ~name~ and ~content~ attributes which are often used together as these attributes specify properties of the entire page
   - The value of the ~name~ attribute is the property you are setting
   - The value of the ~content~ attribute is the value that you want to give to this property
   - For example, you do something like ~<meta name="description" content="Some description about the page">~ which here we are setting the description property and the value is provided by the content attribute
   - Technically, the value of the ~name~ attribute can be anything you want to it be but the browsers can only understand certain predefined values for the ~name~ attribute here is a  [[https://www.reddit.com/r/learnprogramming/comments/66ca34/can_anyone_explain_in_laymans_terms_how_the_meta/][Reddit post about the discussion]]
   - Some defined values for this attribute that are commonly used are:
     1. ~description~: contains a description of the page and commonly used by search engines to understand what the page is about and is sometimes displayed in the search engine results
     2. ~keywords~: contains a list of comma-separated words that a user might search to find that page
     3. ~robots~: indicates whether search engines should add this page to their search results or not; a value of ~noindex~ can be used if this page should not be added and a vaue of ~nofollow~ can be used if search engines should add this page in their results but not any pages that it links to
   - The ~meta~ element also uses the ~http-equiv~ and ~content~ attributes in pairs (similar to name and content but now it is http-equiv and content)
   - Some defined values for ~http-equiv~ are:
     1. ~author~: defines the author of the page
     2. ~pragma~: prevents the browser from caching the page (that is storing the files locally to be faster on subsequent visits)
     3. ~expires~: browsers often cache websites so this indicates when the page should expire and no longer be cached
   - When specifying a value for ~name~ or ~http-equiv~ you must also specify the value in ~content~

