HTML_and_CSS_Design_and_Build_Websites/008.Extra_Markup/008.000.Notes.html

<div id="outline-container-org40a290e" class="outline-3">
<h3 id="org40a290e">Section 8.5: Grouping Text &amp; Elements in a Block</h3>
<div class="outline-text-3" id="text-org40a290e">
<ul class="org-ul">
<li>The <code>&lt;div&gt;</code> element allows you to group a set of elements together in one block-level box</li>
<li>For example, you might create a <code>&lt;div&gt;</code> element to contain all of the elements for the header of your site (like I said this book is outdated, HTML5 introduced new semantic elements that are similar to <code>&lt;div&gt;</code> such as <code>&lt;header&gt;</code> and <code>&lt;nav&gt;</code> that would be better suited for the header of your site)</li>
<li>The <code>&lt;div&gt;</code> element is simply a generic container which allows you to group a set of elements togehter in a one block-level bos but it has no effect on the content or layout until it is styled in some way using CSS</li>
<li>The <code>&lt;div&gt;</code> element can also use the id attribute and class attribute to be styled later with CSS</li>
<li>This includes how much space the div block takes and changing the appearance of all the elements contained with it since CSS has inheritance properties when applying styling to a parent element</li>
<li>Div elements can be nested each other if needed to break down further groups of HTML elements</li>
<li>Div elements can make it easier to understand and follow your code since you are grouping together elements and thus breaking down your web page into small sections</li>
<li>Comments would be also useful to describe what is the purpose for the div element</li>
<li><b>Note</b> that with HTML5 a lot of semantic elements were introduced that behave as <code>&lt;div&gt;</code> but semantically it means differently, it represents a specific type of group such as a header, footer, navigation, etc. basically it is like a div with a meaning</li>
<li>Another container element that is similar <code>&lt;div&gt;</code> is the <code>&lt;span&gt;</code> element</li>
<li>So what's the difference? The <code>&lt;span&gt;</code> element acts like an inline equivalent of the <code>&lt;div&gt;</code> element (div element is a block-level container while span is a inline-level container)</li>
<li>The <code>&lt;span&gt;</code> element is used to either a contain a section of text where there is no other suitable element to differentiate it from its surrounding text or inside the span element there are a number of inline elements that will be grouped using <code>&lt;span&gt;</code></li>
<li>The most common reason people use <code>&lt;span&gt;</code> is so that they can control the appearance of the content or inline elements inside the <code>&lt;span&gt;</code> element</li>
<li>To further have control of styling the <code>&lt;span&gt;</code> element, developers often use the <code>&lt;span&gt;</code> element with the id or class attribute</li>
<li>Finally, <b>note</b> that in HTML5 semantics elements were also introduced to behave similar to <code>&lt;span&gt;</code> (inline container elements) just like there are semantic elements for <code>&lt;div&gt;</code> there are semantics elements for <code>&lt;span&gt;</code> such as the <code>&lt;time&gt;</code> element</li>
<li>These semantic elements are encourgaed when applicable than just a regular <code>&lt;div&gt;</code> or <code>&lt;span&gt;</code> because it is possible to just use div or span but semantic elements had meaning to your code and to assisitive technology which makes development and accessibility great in turn making a good website</li>
</ul>
</div>
</div>

<div id="outline-container-orgbe2b07b" class="outline-3">
<h3 id="orgbe2b07b">Section 8.6: IFrames</h3>
<div class="outline-text-3" id="text-orgbe2b07b">
<ul class="org-ul">
<li>An iFrame is like a little window that has been cut into your page and inside the window that was cut you will be able to see another page</li>
<li>iFrame comes from the abbreviation of inline frame</li>
<li>Common uses of iFrames including embedding content from 3rd party websites such as YouTube videos, Google Maps, Tweets, Vimeo, secure payment flows, etc</li>
<li>An iframe is created using the <code>&lt;iframe&gt;</code> element but there are a few attributes that will be needed to use iframe correctly</li>
<li>One attribute is <code>src</code> which specifies the URL of the page to show in the frame</li>
<li>The <code>height</code> and <code>width</code> specify the height and width of the frame in pixels</li>
<li><code>scrolling</code> attribute will not be supported in HTML5 but in HTML4 and XHTML it is supported and indicates whether the iframe should have scrollbars or not</li>
<li>The <code>scrolling</code> attribute can be one of the three values: yes (show scrollbar), no (hide scrollbar), and auto (show only if needed)</li>
<li><code>frameborder</code> will not be supported in HTML5 but in HTML4 and XHTML it indicates whether the frame should have a border or not (value of 0 indicates no border and value of 1 indicates a border)</li>
<li><code>seamless</code> is an attribute introduced in HTML5 and removes the scrollbars but since then the <code>seamless</code> attribute has been removed and no longer exists (<a href="https://stackoverflow.com/questions/4804604/html5-iframe-seamless-attribute">more information in a Reddit post</a>)</li>
</ul>
</div>
</div>

<div id="outline-container-org4ecd1db" class="outline-3">
<h3 id="org4ecd1db">Section 8.7: Metadata Info About Web Pages</h3>
<div class="outline-text-3" id="text-org4ecd1db">
<ul class="org-ul">
<li>The <code>&lt;meta&gt;</code> elements lives inside the <code>&lt;head&gt;</code> element and contains information about that specific web page</li>
<li>It is not visible to users but fulfills a number of purposes such as telling search engines about your page, who created it, whether or not it is time sensitive, and more</li>
<li>The <code>&lt;meta&gt;</code> element is a self-closing element so it does not have a closing tag and it uses the attributes to carry the information</li>
<li>The most common attributes are the <code>name</code> and <code>content</code> attributes which are often used together as these attributes specify properties of the entire page</li>
<li>The value of the <code>name</code> attribute is the property you are setting</li>
<li>The value of the <code>content</code> attribute is the value that you want to give to this property</li>
<li>For example, you do something like <code>&lt;meta name="description" content="Some description about the page"&gt;</code> which here we are setting the description property and the value is provided by the content attribute</li>
<li>Technically, the value of the <code>name</code> attribute can be anything you want to it be but the browsers can only understand certain predefined values for the <code>name</code> attribute here is a  <a href="https://www.reddit.com/r/learnprogramming/comments/66ca34/can_anyone_explain_in_laymans_terms_how_the_meta/">Reddit post about the discussion</a></li>
<li>Some defined values for this attribute that are commonly used are:
<ol class="org-ol">
<li><code>description</code>: contains a description of the page and commonly used by search engines to understand what the page is about and is sometimes displayed in the search engine results</li>
<li><code>keywords</code>: contains a list of comma-separated words that a user might search to find that page</li>
<li><code>robots</code>: indicates whether search engines should add this page to their search results or not; a value of <code>noindex</code> can be used if this page should not be added and a vaue of <code>nofollow</code> can be used if search engines should add this page in their results but not any pages that it links to</li>
</ol></li>
<li>The <code>meta</code> element also uses the <code>http-equiv</code> and <code>content</code> attributes in pairs (similar to name and content but now it is http-equiv and content)</li>
<li>Some defined values for <code>http-equiv</code> are:
<ol class="org-ol">
<li><code>author</code>: defines the author of the page</li>
<li><code>pragma</code>: prevents the browser from caching the page (that is storing the files locally to be faster on subsequent visits)</li>
<li><code>expires</code>: browsers often cache websites so this indicates when the page should expire and no longer be cached</li>
</ol></li>
<li>When specifying a value for <code>name</code> or <code>http-equiv</code> you must also specify the value in <code>content</code></li>
</ul>
</div>
</div>
