Web/HTML_and_CSS_Design_and_Build_Websites/008.Extra_Markup/008.000.Notes.org
** Section 8.8: Escape Characters
   - There are reserved characters that are used and reserved in HTML code
   - But what if you want to display these characters like the angled brackets? Well in order to do this you need to use "escape" characters
   - For example, to write a left angled bracket you can either write ~&lt;~ or ~&#60;~
   - These escape characters or escape codes shown above are special codes that can be used to show symbols such as copyright, trademark, currency symbols, mathematical characters, and punctuation marks
   - When using escape characters make sure it is appearing correcting in your page because not all fonts support all of the characters so you might need to specify a different font for these characters (a font that actually supports these characters) in your CSS code

** Section 8.9: Simple Web Page with Extra Markup
   - [[file:./008.009.Simple_Web_Page_with_Extra_Markup/index.html][Simple Web Page with Extra Markup]]

* Keywords
| Term              | Definition                                                                                                                                                                                                                                                 |
|-------------------+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| HTML4             | HTML markup language version 4 published as a W3C recommendation in 1997                                                                                                                                                                                   |
| HTML5             | HTML markup language version 5 published as a W3C recommendation in 2014                                                                                                                                                                                   |
| XML               | Markup language that can allow others to create their own markup language and it is used to format data, store data, and transmit data                                                                                                                     |
| XHTML             | An extensible version of HTML created to work with XML                                                                                                                                                                                                     |
| HTML Comments     | HTML comments are specified by ~<!-- comment -->~ and are ignored by the browsers; comments are there just for the developer to see                                                                                                                        |
| ID Attribute      | A unique value given to an element to unqiue identify it, it cannot share the id value with any other element in the page                                                                                                                                  |
| Class Attribute   | A unique value given to a /group/ of elements to uniquely identify /the/ group, the elements in the group do not have to be same type of HTML element, an element may have more than one class, and the group should be named differently than another group        |
| Block Elements    | If an element is a block element will start on a new line and by default take up the whole width of the new line regardless of the content                                                                                                                 |
| Inline Elements   | If an element is an inline element will take up the space of only the content and continue right next to the previous element; in other words, it will not start on a new line or take up the whole width of the new line                                  |
| Div Element       | Generic block level container element to group elements; it has no affect on content or layout                                                                                                                                                             |
| Span Element      | Generic inline level container element to group elements; it has no affect on content or layout                                                                                                                                                            |
| iFrame Element    | An element that can be used to embed another website into a window in your page                                                                                                                                                                            |
| Meta Element      | An element used to represent metadata that cannot be represent by any other element; often the meta element is used with attributes to provide metadata about the page and often used by browsers and search-engines                                       |
| Escape Characters | A sequence of characters that are able to represent characters that are either unable to represent with a keyboard or conflict with characters used in the markup language                                                                                 |

