HTML_and_CSS_Design_and_Build_Websites/008.Extra_Markup/008.000.Notes.html

<div id="outline-container-org0e17c10" class="outline-3">
<h3 id="org0e17c10">Section 8.8: Escape Characters</h3>
<div class="outline-text-3" id="text-org0e17c10">
<ul class="org-ul">
<li>There are reserved characters that are used and reserved in HTML code</li>
<li>But what if you want to display these characters like the angled brackets? Well in order to do this you need to use "escape" characters</li>
<li>For example, to write a left angled bracket you can either write <code>&amp;lt;</code> or <code>&amp;#60;</code></li>
<li>These escape characters or escape codes shown above are special codes that can be used to show symbols such as copyright, trademark, currency symbols, mathematical characters, and punctuation marks</li>
<li>When using escape characters make sure it is appearing correcting in your page because not all fonts support all of the characters so you might need to specify a different font for these characters (a font that actually supports these characters) in your CSS code</li>
</ul>
</div>
</div>

<div id="outline-container-org09b5328" class="outline-3">
<h3 id="org09b5328">Section 8.9: Simple Web Page with Extra Markup</h3>
<div class="outline-text-3" id="text-org09b5328">
<ul class="org-ul">
<li><a href="./008.009.Simple Web Page with Extra Markup/index.html">Simple Web Page with Extra Markup</a></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org276b519" class="outline-2">
<h2 id="org276b519">Keywords</h2>
<div class="outline-text-2" id="text-org276b519">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Term</th>
<th scope="col" class="org-left">Definition</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">HTML4</td>
<td class="org-left">HTML markup language version 4 published as a W3C recommendation in 1997</td>
</tr>

<tr>
<td class="org-left">HTML5</td>
<td class="org-left">HTML markup language version 5 published as a W3C recommendation in 2014</td>
</tr>

<tr>
<td class="org-left">XML</td>
<td class="org-left">Markup language that can allow others to create their own markup language and it is used to format data, store data, and transmit data</td>
</tr>

<tr>
<td class="org-left">XHTML</td>
<td class="org-left">An extensible version of HTML created to work with XML</td>
</tr>

<tr>
<td class="org-left">HTML Comments</td>
<td class="org-left">HTML comments are specified by <code>&lt;!-- comment --&gt;</code> and are ignored by the browsers; comments are there just for the developer to see</td>
</tr>

<tr>
<td class="org-left">ID Attribute</td>
<td class="org-left">A unique value given to an element to unqiue identify it, it cannot share the id value with any other element in the page</td>
</tr>

<tr>
<td class="org-left">Class Attribute</td>
<td class="org-left">A unique value given to a <i>group</i> of elements to unique identify <i>the</i> group, the elements in the group do not have to be same type of HTML element, an element may have more than one class, and the group should be named differently than another group</td>
</tr>

<tr>
<td class="org-left">Block Elements</td>
<td class="org-left">If an element is a block element will start on a new line and by default take up the whole width of the new line regardless of the content</td>
</tr>

<tr>
<td class="org-left">Inline Elements</td>
<td class="org-left">If an element is an inline element will take up the space of only the content and continue right next to the previous element; in other words, it will not start on a new line or take up the whole width of the new line</td>
</tr>

<tr>
<td class="org-left">Div Element</td>
<td class="org-left">Generic block level container element to group elements; it has no affect on content or layout</td>
</tr>

<tr>
<td class="org-left">Span Element</td>
<td class="org-left">Generic inline level container element to group elements; it has no affect on content or layout</td>
</tr>

<tr>
<td class="org-left">iFrame Element</td>
<td class="org-left">An element that can be used to embed another website into a window in your page</td>
</tr>

<tr>
<td class="org-left">Meta Element</td>
<td class="org-left">An element used to represent metadata that cannot be represent by any other element; often the meta element is used with attributes to provide metadata about the page and often used by browsers and search-engines</td>
</tr>

<tr>
<td class="org-left">Escape Characters</td>
<td class="org-left">A sequence of characters that are able to represent characters that are either unable to represent with a keyboard or conflict with characters used in the markup language</td>
</tr>
</tbody>
</table>
</div>
</div>
