HTML_and_CSS_Design_and_Build_Websites/008.Extra_Markup/008.000.Notes.html

<div id="outline-container-org339ed35" class="outline-2">
<h2 id="org339ed35">Questions</h2>
<div class="outline-text-2" id="text-org339ed35">
<ul class="org-ul">
<li><b>Q</b>: What happened to XHTML?
<ul class="org-ul">
<li><a href="https://softwareengineering.stackexchange.com/questions/149839/is-xhtml5-dead-or-is-it-just-an-synonym-of-html5">StackExchange Answer</a></li>
<li><a href="https://retrocomputing.stackexchange.com/questions/29933/why-did-xml-lose-out-to-xhtml-then-html-5-on-the-web">Another StackExchange Answer</a></li>
<li><a href="https://www.reddit.com/r/webdev/comments/410s0a/is_xhtml_dead/">Reddit Discussion</a></li>
<li>The short answer is that it basically got replaced with HTML5</li>
<li>The problem with HTML4 was it did not have strict rules like XML and it was also hard to gather information from websites using HTML</li>
<li>What was the solution? Use XML to have stricter rules and be able to parse XML payloads from websites via XML parsing technologies</li>
<li>The problem was developers weren't so motivated to XHTML, browsers often did not support all features or misunderstood XHTML support, and standards were not as high as it is today leading to bad adoption</li>
<li>In addition, with the introduction of web APIs and JSON there was no need to use XML payloads but instead use web apis to get JSON payloads</li>
<li>Thus when HTML5 was introduced to fix various flaws of HTML4 and introduce new features to keep up with modern web technologies</li>
<li>So XHTML lost favor with HTML5 because HTML5 along with JSON are great tools and very sufficient for today's standards</li>
</ul></li>

<li><b>Q</b>: If you declare a block level element and then an inline level element, would the inline element be right next to the block level element or start on a new line?
<ul class="org-ul">
<li>Let's test it then, here is the <a href="./008.010.Questions/q2.html">web page test</a></li>
<li>The answer is that the inline element will be in the next line after the block level element</li>
<li>Why is that? This is because the block element will take up the whole width of the screen (block) or a width specified in CSS</li>
<li>In other words, the block element will act as a block of its surrounding areas and if any element tries to be placed then it will need to be done outside of the block</li>
<li>This is why block elements take up a whole new line because they will use all the new line even if it doesn't have content so when a new element (e.g. an inline element) appears it will start in a new line because the current new line is occupied by the block element (div)</li>
</ul></li>

<li><b>Q</b>: Are <code>&lt;div&gt;</code> elements block elements?
<ul class="org-ul">
<li>Yes div elements are block level elements (<a href="https://developer.mozilla.org/en-US/docs/Glossary/Block-level_content">Mozilla Block Level Content Docs</a>)</li>
</ul></li>

<li><b>Q</b>: Are iFrames still used? Do we need the height and width attribute in an iFrame, can we use CSS instead?
<ul class="org-ul">
<li><a href="https://www.reddit.com/r/webdev/comments/y8fxkp/do_modern_developers_actually_use_iframes_for/">Reddit Discussion</a></li>
<li>iFrames are still used but they are mostly used to embed 3rd party services into web pages such as videos from YouTube, Google Maps, Tweets, payment services, and more</li>
<li>Yes you can use CSS to specify height and width for an iframe element as shown in the <a href="./008.010.Questions/q4.html">example test</a></li>
<li>In the example test we use CSS to specify the height and width</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgbecab15" class="outline-2">
<h2 id="orgbecab15">Summary</h2>
<div class="outline-text-2" id="text-orgbecab15">
<ul class="org-ul">
<li>HTML4 was released in 1997; it had many presentational elements such as centering elements</li>
<li>In 1998, XML was introduced and XHTML was created in 2000; XHTML reformulated (or extended) HTML4 to follow XML rules and work well with other XML data formats</li>
<li>XHTML never got full traction and in 2014 HTML5 was introduced getting rid of presentational elements and leaving it to CSS, introducing semantic elements, new elements and technologies for the modern web, and more, essentially replacing XHTML and HTML4</li>
<li>You can specify the HTML version by using <code>DOCTYPE</code> in the beginning of the file before writing the <code>&lt;html&gt;</code> tags (to specify HTML5 you write <code>&lt;!DOCTYPE html&gt;</code></li>
<li>You can write comments using <code>&lt;!-- comment --&gt;</code> which are ignored by the browser and are only there for the developer to see</li>
<li>The id attribute is used to provide a unique value given to an element to unqiue identify it, it cannot share the id value with any other element in the page</li>
<li>The class attribute is used to a unique value given to a <i>group</i> of elements to unique identify <i>the</i> group, the elements in the group do not have to be same type of HTML element, an element may have more than one class, and the group should be named differently than another group</li>
<li>Block elements are elements that will start on a new line and by default take up the whole width of the new line regardless of the content</li>
<li>Inline elements are elements that will take up the space of only the content and continue right next to the previous element; in other words, it will not start on a new line or take up the whole width of the new line</li>
<li>Div element is a generic <b>block</b> level container element to group elements; it has no affect on content or layout (besides being block level)</li>
<li>Span element is a generic <b>inline</b> level container element to group elements; it has no affect on content or layout (besides being inline level)</li>
<li>These are often used with ids and classes to style that particular group of elements</li>
<li>With HTML5, semantics elements were introduced, these semantic elements behave similarly to div and span but now have some sense of meaning; how so? Well now we can give a group of elements a purpose with a semantic element instead of using the div element</li>
<li>Although div elements can still be used instead of these semantic elements, semantic elements are better for assistive technology and developers because they give meaning to a group of elements or for that section (e.g. instead of using div to group elements that composes the navigation section of the web page we can now use the <code>&lt;nav&gt;</code> element)</li>
<li>The <code>&lt;iframe&gt;</code> element can be used to designate a window in your page to show another website in the window; it is often used with videos from Vimeo and Youtube, tweets, Google Maps, or any other 3rd party service</li>
<li>The book presents various attributes for <code>&lt;iframe&gt;</code> but the attributes are outdate and most no longer exist in HTML5</li>
<li>The meta element is used to represent metadata that cannot be represent by any other element; often the meta element is used with attributes to provide metadata about the page and often used by browsers and search-engines</li>
<li>Often the meta element is used with the attributes <code>name</code> and <code>content</code> as name / content pairs</li>
<li>You use the name attribute to specify what info do you want to provide and you use the content attribute to give the value to the info you want to provide (to what you specified in the name attribute)</li>
<li>You can also use the <code>http-equiv</code> and <code>content</code> pairs which is similar to name / content pairs but instead of the name attribute you use the <code>http-equiv</code> attribute</li>
<li>Finally, you can use escape characters in HTML to display symbols or characters that are hard to type or conflict with the HTML</li>
<li>However, not all fonts support all characters, if the font you are using does not support the symbol you are trying to display, you will need to change font to a font that does support the symbol using CSS</li>
</ul>
</div>
</div>
</div>
</body>
</html>
